Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/inauguration_and_removal_of_the_president.html.txt.tmx
Source language: en
Languages: ga

source: Inauguration and removal of the President
ga: Uachtarán a gharim agus a chur as oifig

source: The candidate who has won the presidential election becomes President of Ireland by publicly making the following oath
ga: Rachaidh an té a bhuaigh toghchán an uachtaráin i gcúram oifige leis an dearbhú seo a leanas a dhéanamh go poiblí mar atá leagtha síos i mBunreacht na hÉireann

source: "In the presence of Almighty God I do solemnly and sincerely promise and declare that I will maintain the Constitution of Ireland and uphold its laws, that I will fulfil my duties faithfully and conscientiously in accordance with the Constitution and the law, and that I will dedicate my abilities to the service and welfare of the people of Ireland
ga: "I láthair Dia na nUilechumhacht, táimse, á ghealladh agus á dhearbhú go sollúnta is go fírinneach bheith i mo thaca agus i mo dhídin do Bhunreacht na hÉireann, agus a dlíthe a chaomhnú, mo dhualgais a chomhlíonadh go dílis coinsiasach de réir an Bhunreacht is an dlí, agus mo lándícheall a dhéanamh ar son leasa is fónaimh mhuintir na hÉireann

source: May God direct and sustain me"
ga: Dia do mo stiúradh agus do mo chumhdach."

source: The President is inaugurated in St Patrick's Hall in Dublin Castle and makes the declaration in the presence of members of both Houses of the Oireachtas, the Judges of the Supreme Court, the Court of Appeal and the High Court and other public persons
ga: Déantar an tUachtarán a ghairm i Halla Naomh Phádraig, Caisleán Átha Cliath agus déanann sé/sí an dearbhú i láthair baill Tithe an Oireachtais, Breithimh na Cúirte Uachtaraí, na Cúirte Achomhairc agus na hArdchúirte agus pearsana poiblí eile

source: Removal of a President from office
ga: Uachtarán a chur as oifig

source: There are 2 situations when a President may be removed from office
ga: Tá 2 chás gur féidir Uachtarán a chur as oifig

source: If 5 Supreme Court judges or more decide that a President has become permanently incapacitated, the President's term of office will come to an end
ga: Má dhéanann 5 nó níos mó breitheamh den Chúirt Uachtarach cinneadh go bhfuil an tUachtarán ar míthreoir go buan, tiocfaidh deireadh lena t(h)éarma oifige

source: The President may also be impeached by either House of the Oireachtas for "stated misbehaviour"
ga: Is féidir le ceachtar de Thithe an Oireachtais an tUachtarán a tháinseamh as ucht "mí-iompair a luafar"

source: Stated misbehaviour might include a criminal offence or a misuse of the President's powers
ga: D'fhéadfadh sé go mbeadh coir choiriúil nó míúsáid cumhachtaí an Uachtaráin i gceist leis an mí-iompair luaite

source: To propose a motion to impeach the President, at least 30 members of one House of the Oireachtas must sign the proposal
ga: Ní mór do, ar a laghad, 30 comhalta de cheachtar de Thithe an Oireachtais rún a shíniú go ndéanfaí an tUachtarán a tháinseamh leis an rún sin a mholadh

source: Then at least two-thirds of all of the members of that House must vote in favour of the proposal
ga: Ansin, le glacadh leis an rún, ní mór go mbeadh tacaíocht dhá thrian, ar a laghad, de chomhaltaí uilig an tí sin ag an rún

source: The other House of the Oireachtas must then investigate the charge that the President is guilty of stated misbehaviour
ga: Ní mór ansin don Teach eile scrúdú a dhéanamh ar an gcúiseamh go bhfuil an tUachtarán ciontach as mí-iompair luaite

source: The investigation may be carried out by a committee or tribunal
ga: Is féidir le coiste nó binse fiosruithe an chúis a scrúdú

source: The President has a right to appear and be represented at the investigation of the charge
ga: Tá sé de cheart ag an Uachtarán a bheith i láthair agus an chúis dhá scrúdú

source: At the end of the investigation, two-thirds of the members of the investigating House must pass a resolution declaring that the President is guilty of stated misbehaviour
ga: Ag deireadh an scrúdaithe, ní mór do dhá thrian den Teach a rinne an scrúdú tacú le rún a dhearbhaíonn go bhfuil an tUachtarán ciontach as mí-iompair luaite

source: The President's term of office will then come to an end
ga: Tiocfaidh deireadh ansin le tréimhse oifige an Uachtaráin

source: This means that in order to remove the President, two-thirds of the total membership of both Houses of the Oireachtas must vote in favour of that course of action
ga: Mar sin leis an Uachtarán a chur as oifig, ní mór do dhá thrian de chomhaltaí uilig Tithe an Oireachtais vóta a chaitheamh i bhfabhar é sin a dhéanamh
